[
    {
        "created": "2023-07-21T06:43:58+00:00",
        "expires": "2023-08-17T06:43",
        "sourced": "public domain",
        "unique": 1252405,
        "companyName": "Robert Half US",
        "companyUrl": "https://zobjobs.com/company/false",
        "title": "WordPress Web Developer",
        "description": "Description<br><br>Seeking a WordPress Web Developer in Dania Beach, FL! Apply today for immediate consideration<br><br>We are looking for an experienced Web Developer to join our growing ecommerce team. A successful person in this role will be able to work independently and maintain our current and future state ecommerce infrastructure.<br><br>Essential Job Duties:<br><br>• Work with PHP, JavaScript, HTML, and CSS to enhance WordPress websites<br><br>• Define and assess new plugins, frameworks, applications, and platforms to match business requirements for ecommerce and digital marketing<br><br>• Analyze business requirements and design, develop, test, and publish technical solutions<br><br>• Create and maintain product documentation: requirements, specification, design, development, integration, results<br><br>• Implement best practices, standards, and procedures including quality and performance of the applications<br><br>• Develop and execute end-to-end and unit testing to ensure and maintain source code quality<br><br>Requirements<br><br>Requirements:<br><br>• Senior level experience in WordPress and WooCommerce<br><br>• Experience consuming REST APIs, JSON and MySQL databases<br><br>• A deep understanding of HTML, CSS, MySQL, SSH, CLIs and Git<br><br>• Knowledgeable in server-based technologies and ecommerce platforms<br><br>• Experience with jQuery, AJAX, and Advanced Custom Fields (ACF)<br><br>Experience:<br><br>• Bachelor’s degree in computer science, or equivalent experience<br><br>• 3+ years of experience managing the following tech stack: WordPress, WooCommerce, Klaviyo, YotPo<br><br>• Shopify experience a bonus<br><br>• Background in a high transaction CPG online business<br><br>• Previous startup experience a plus<br><br>Technology Doesnt Change the World, People Do.®<br><br>Robert Half is the world’s first and largest specialized talent solutions firm that connects highly qualified job seekers to opportunities at great companies. We offer contract, temporary and permanent placement solutions for finance and accounting, technology, marketing and creative, legal, and administrative and customer support roles.<br><br>Robert Half puts you in the best position to succeed by advocating on your behalf and promoting you to employers. We provide access to top jobs, competitive compensation and benefits, and free online training. Stay on top of every opportunity – even on the go. Download the Robert Half app and get 1-tap apply, instant notifications for AI-matched jobs, and more.<br><br>All applicants applying for U.S. job openings must be legally authorized to work in the United States. Benefits are available to contract/temporary professionals, including medical, vision, dental, and life and disability insurance. Hired contract/temporary professionals are also eligible to enroll in our company 401(k) plan. Visit roberthalf.gobenefits.net for more information.<br><br>© 2023 Robert Half. An Equal Opportunity Employer. M/F/Disability/Veterans. By clicking “Apply Now,” you’re agreeing to Robert Half’s Terms of Use",
        "link": "https://zobjobs.com/job/wordpress-web-developer-website-job-in-usa-zj6hqqpnkhhl",
        "category": [
            "Website",
            "html",
            "HTML"
        ],
        "location": "United States US",
        "country": "US"
    },
    {
        "created": "2023-07-21T06:43:58+00:00",
        "expires": "2023-08-17T06:43",
        "sourced": "public domain",
        "unique": 1252404,
        "companyName": "Upwork",
        "companyUrl": "https://zobjobs.com/company/false",
        "title": "UI/UX Developer for website and mobile application ",
        "description": "<p>It all started as a self initiative tool that I developed 8 years ago, and I’ve been developing and using this tool till now in all shades of operations and contexts, in the private sector for managing projects with a very dynamic operations and teams attached, up to connecting teams operating in different countries together, and then for another 5 years in the humanitarian development sector, on both implementers/grantee side, when I worked for years as a field person who interacts very closely with the beneficiaries and works in the field most of the time, and 2 years ago when I saw the gap between the field and the operations offices, where we (humanitarian actors) are operating and trying to achieve (in the filed) what is planned and decided (in the offices), yet not always the offices are well informed enough of what we are witnessing in the field.</p><p>The platform am creating (the dashboard as I call it now) is a real-time tool that gives all different roles of the project stakeholders(SH) the ability to have a real, visualized and unified sense of what is happening in the field as an impact of their project/s, it empowers the SH to plan, implement, monitor and control, make decisions, learn, up to designing the next intervention, but with being very well informed by the field context, progress and potentials, and also, supports them to be proactive mitigating or preventing field challenges.</p><p>I need to create a real time dynamic, smooth, user friendly and secure website (later followed by a mobile app) to serve connecting the operations and activities in the field (progress, status and monitoring, KPIs) with the decision making processes in the offices and top management members.</p><p>We can meet and discuss further.</p><p>Thank you for your time reading the brief,</p><p>Nosiba</p>",
        "link": "https://zobjobs.com/job/ui-ux-developer-for-website-and-mobile-application-job-in-usa-zj6hqqpnjput",
        "category": [
            "Website"
        ],
        "location": "US",
        "country": "US"
    },
    {
        "created": "2023-07-21T06:43:58+00:00",
        "expires": "2023-08-17T06:41",
        "sourced": "public domain",
        "unique": 1252403,
        "companyName": "Arden Resourcing Limited",
        "companyUrl": "https://zobjobs.com/company/false",
        "title": "Full Stack Developer (React JS) – Solihull",
        "description": "Full Stack Developer (React JS) – Solihull<br><br>Innovative software company providing leading edge solutions to the automotive and transport sector are looking for an experienced, motivated team player to join their talented, international team. The role will be working as part of an experienced team to deliver cutting edge web-based solutions using React JS for both ongoing core product development and specific client projects. You will need to have proven development experience developing web / browser-based applications using React JS coupled with developing REST APIs using Node JS or Python. You will have solid understanding of HTML, CSS, JavaScript and an understanding of UI libraries. Experience with deployment using Docker and Kubernetes would be a distinct advantage as well as database experience with MongoDB or Mongoose. They require someone with excellent communication skills and the desire to work as part of a team that prides itself on its problem-solving ability and promoting innovation. They offer a friendly environment with a team who help and encourage each other along with a flexible structure to work. The role requires someone to be in the office for 2 days a week to work collaboratively and plan with the development team in Their Solihull office. They are working on leading edge technology solutions for the sector and encourage learning and technical growth as well as offering career progression opportunities.<br><br>Arden Resourcing Limited is acting as an employment agency regards the above position",
        "link": "https://zobjobs.com/job/full-stack-developer-react-js-solihull-reactjs-job-in-uk-zj6hqqpnd6la",
        "category": [
            "reactjs"
        ],
        "location": "United Kingdom UK",
        "country": "GB"
    },
    {
        "created": "2023-07-21T06:43:58+00:00",
        "expires": "2023-08-17T06:37",
        "sourced": "public domain",
        "unique": 1252402,
        "companyName": "ICF Next",
        "companyUrl": "https://zobjobs.com/company/false",
        "title": "Senior Experience Developer, Front End - Remote",
        "description": "The Company<br><br>ICF is a mission-driven company filled with people who care deeply about improving the lives of others and making the world a better place. Our core values include Embracing Difference; we seek candidates who are passionate about building a culture that encourages, embraces, and hires dimensions of difference<br><br>@ ICF Next, a division of ICF, we are fearless in finding new ways to solve problems, relentless in making sure it pays off for our clients and committed to making a positive change in the world. Join our community of mission-driven creatives, communicators, strategists, and technologists to challenge the status quo.<br><br>The Work<br><br>As a Senior Experience Developer, this person will collaborate within an Agile development team to interpret requirements, design technical solutions, provide estimates and feedback, and deliver high-quality code to a Java/NodeJS and AngularJS web application.<br><br>The ideal candidate will add value in discussions with the Agile team to understand project requirements and issues and design solutions. Senior Experience Developers build solutions independently or in partnership with a technical architect, and contribute to development tasks performed by others, and support QA engineers and clients through UAT and deployment.<br><br>Basic Qualifications<br>• Associate degree or other formal front end technical training certificate<br>• 5+ years of professional experience building web applications (SPA)<br>• 4+ years of experience with the AngularJS JavaScript application framework<br>• 4+ years of experience with HTML, CSS, ES6 JavaScript and Web Standards<br>• 4+ years of experience with NodeJS<br>• 4+ years of experience with browser developer tools, git code versioning platforms, and JIRA<br>• 4+ years of experience with workflow automation and build tooling including webpack/NPM, JavaScript testing (Cypress) and build tools, and CI/CD tools<br>• 4+ years of experience with Agile Software Development practices and concepts<br>• 2+ years of experience with Web Component development<br><br>Technical Skills<br>• HTML/CSS<br>• JavaScript ES6<br>• Angular.js<br>• Node.js<br>• LIT<br>• Java and Spring Boot<br>• Webpack<br>• LESS, Bootstrap<br>• Git<br>• JIRA, Confluence or similar<br>• Browser Developer Tools<br>• Agile Software Development (SAFe)<br><br>Preferred Skills And Experience<br>• Proficiency with Java web application development with Spring Boot<br>• Proficiency with WCAG guidelines and Web Accessibility development practices<br>• Ability to design technical solutions and provide technical estimates<br>• Experience with deployment of web solutions<br>• Experience with JavaScript testing with Cypress/Mocha, debugging, and performance tuning<br>• Experience writing and reviewing software requirements documentation<br>• Experience conducting and participating in code reviews and providing technical guidance to peer developers<br>• Strong technical and consultative communication skills<br>• Ability to provide leadership and mentoring to other developers<br>• Experience with web and application UX and visual design consultation and planning<br>• Experience with web and web application technical design and planning<br>• Familiarity with Restify Node library<br>• Experience with SQL Server, Spring Batch, Hibernate, Redis,<br>• Familiarity Drone, Kubernetes, Helm, and Containerization<br>• Familiarity with lit Web Component library<br><br>Working at ICF<br><br>ICF is a global advisory and technology services provider, but we’re not your typical consultants. We combine unmatched expertise with cutting-edge technology to help clients solve their most complex challenges, navigate change, and shape the future. We can only solve the worlds toughest challenges by building an inclusive workplace that allows everyone to thrive. We are committed to creating a culture where we embrace our differences in ideas and identities. Together, our employees are empowered to share their expertise and collaborate with others to achieve personal and professional goals. Learn more about what we do http://www.icf.com/ and our commitment to inclusionhttps://www.icf.com/company/about/diversity-inclusion.<br><br>We can only solve the worlds toughest challenges by building an inclusive workplace that allows everyone to thrive. We are an equal opportunity employer, committed to hiring regardless of any protected characteristic, such as race, ethnicity, national origin, color, sex, gender identity/expression, sexual orientation, religion, age, disability status, or military/veteran status. Together, our employees are empowered to share their expertise and collaborate with others to achieve personal and professional goals. For more information, please read our EEO & AA policy.<br><br>Reasonable Accommodations are available, including, but not limited to, for disabled veterans, individuals with disabilities, and individuals with sincerely held religious beliefs, in all phases of the application and employment process. To request an accommodation please email icfcareercenter@icf.com and we will be happy to assist. All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations. Read more about non-discrimination: Know Your Rights and Pay Transparency Statement.<br><br>Pay Range - There are multiple factors that are considered in determining final pay for a position, including, but not limited to, relevant work experience, skills, certifications and competencies that align to the specified role, geographic location, education and certifications as well as contract provisions regarding labor categories that are specific to the position. The pay range for this position is:<br><br>$100,034.00 - $170,058.00<br><br>Nationwide Remote Office (US99",
        "link": "https://zobjobs.com/job/senior-experience-developer-front-end-remote-html-job-in-usa-zj6hqqpn22el",
        "category": [
            "HTML"
        ],
        "location": "United States US",
        "country": "US"
    },
    {
        "created": "2023-07-21T06:43:58+00:00",
        "expires": "2023-08-17T06:37",
        "sourced": "public domain",
        "unique": 1252401,
        "companyName": "TEKsystems",
        "companyUrl": "https://zobjobs.com/company/false",
        "title": "Full Stack Developer",
        "description": "<p><strong>Description:</strong></p>\n\t\t\t\t\t<p>Before our software developers write even a single line of code, they strive to understand what drives our customers. What is their environment or user story based on? Implementation means – trying, testing, and improving outcomes until a final solution emerges. Knowledge means discussions with colleagues from all over the world. Join our team and enjoy the freedom to think in completely new categories.\nAs a Full Stack Developer at Siemens Smart Infrastructure, you will collaborate across interdisciplinary teams to improve and develop Embedded software products for Smart Buildings. You will have the opportunity to apply Edge and Web technologies in our products to enable smart buildings\n\nWhat We Ask of You\n• Proficient in design, implementation, testing, troubleshooting, and enhancing software applications for large building automation systems\n• Collaborate with product management and architects to understand and elaborate market requirements to propose and implement product designs\n• Develop and run automated tests. Experience parallelizing e2e test execution (Cypress , Selenium, etc…) to further speed up CI/CD pipeline strongly desired\n• Advanced understanding of quality attributes and their impact on software products, design, and development\n• Review technical documentation for internal process and external customer support\n• Participate in the resolution of field problems of existing products based on thorough system impact analysis\n• Ability to write self-evident, efficient, secure, and clean code</p>\n\t\t\t\t\t<p><strong>Skills:</strong></p>\n\t\t\t\t\t<p>Javascript, Angular, Html, typescript, Aws</p>\n\t\t\t\t\t<p><strong>Top Skills Details:</strong></p>\n\t\t\t\t\t<p>Javascript,Angular,Html,typescript</p>\n\t\t\t\t\t<p><strong>Additional Skills & Qualifications:</strong></p>\n\t\t\t\t\t<p>Qualified Applicants must be legally authorized for employment in the United States. Qualified Applicants will not require employer sponsored work authorization now or in the future for employment in the United States.\nThis position requires employees to be fully vaccinated against <span style=\"color:rgb(8,7,7);\"><span style=\"color:rgb(8,7,7);\">COVID-19</span></span> unless they are granted a medical or religious exemption\n\nQualifications\n• Bachelor’s degree or equivalent experience in Computer Science or related field\n• 3+ years of proven full stack and front-end experience developing web applications\n• Proven experience developing with HTML CSS/SASS\n• Coding expertise in Typescript/Angular\n• Strong Object-oriented programming skills with RxJS and observable patterns experience\n• Experience delivering quality code that is fully tested at both unit level and end to end, gated through a continuous integration pipeline\n• Strong communication and collaboration skills in global setup\n• Passionate and self-motivated to learn, and keen to constantly improve and develop skills to stay current with technology</p>\n\t\t\t\t\t<p><strong>Experience Level:</strong></p>\n\t\t\t\t\t<p>Intermediate Level<p> </p>\n        <p> </p>\n\n       <h4>About TEKsystems:</h4>\n       \n<p>We're partners in transformation. We help clients activate ideas and solutions to take advantage of a new world of opportunity. We are a team of 80,000 strong, working with over 6,000 clients, including 80% of the Fortune 500, across North America, Europe and Asia. As an industry leader in Full-Stack Technology Services, Talent Services, and real-world application, we work with progressive leaders to drive change. That's the power of true partnership. TEKsystems is an Allegis Group company. </p>\n<p>The company is an equal opportunity employer and will consider all applications without regards to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law.</p>\n\n",
        "link": "https://zobjobs.com/job/full-stack-developer-html-job-in-usa-zj6hqqpn1lai",
        "category": [
            "HTML"
        ],
        "location": "Chicago Illinois USA",
        "country": "US"
    },
    {
        "created": "2023-07-21T06:43:58+00:00",
        "expires": "2023-08-17T06:34",
        "sourced": "public domain",
        "unique": 1252400,
        "companyName": "Sandia National Laboratories",
        "companyUrl": "https://zobjobs.com/company/false",
        "title": "Software Systems Engineer (Experienced) - Remote",
        "description": "About Sandia Sandia National Laboratories is the nations premier science and engineering lab for national security and technology innovation, with teams of specialists focused on cutting-edge work in a broad array of areas. Some of the main reasons we love our jobs: Challenging work with amazing impact that contributes to security, peace, and freedom worldwide Extraordinary co-workers Some of the best tools, equipment, and research facilities in the world Career advancement and enrichment opportunities Flexible work arrangements for many positions include 9/80 (work 80 hours every two weeks, with every other Friday off) and 4/10 (work 4 ten-hour days each week) compressed workweeks, part-time work, and telecommuting (a mix of onsite work and working from home) Generous vacations, strong medical and other benefits, competitive 401k, learning opportunities, relocation assistance and amenities aimed at creating a solid work/life balance* World-changing technologies. Life-changing careers.<br><br>Learn more about Sandia at: http://www.sandia.gov *These benefits vary by job classification. What Your Job Will Be Like We are seeking a highly motivated, self-starting Software Systems Engineer to support a team that designs, implements, maintains and supports enterprise class, highly available, scalable and secure information systems and applications. On any given day, you may be called on to: Develop or modify information systems, including analyzing business and user needs, detailing requirements, and revising existing system logic difficulties as needed Develop new software or improve, modify, or correct existing software Apply critical thinking to deliver user-experience solutions with a focus on user needs and business goals Build and guide the design of user experiences.<br><br>Interface designs for software features and products with a focus on user needs and business goals Participate in defining interfaces between software systems Participate in defining and may participate in performing software build, release, and installation procedures Document technical standards and functionality tests to develop specifications, prototypes, or initial user guides Collaborate effectively with developers, testers, product managers, and other team members Analyze and evaluate new software technologies Know the latest technologies, industry trends and best practices Apply standard software engineering practices in the development of the software solutions The selected applicant can be a virtual worker located in any U.S. State or District of Columbia. Regular or periodic travel to your assigned work location may be required.<br><br>Qualifications We Require Bachelors degree in Management Information Systems, Information Assurance or related field; or equivalent (AS + 9 years or no degree + 13 years) Experience with full software development life-cycle using iterative or agile methods Ability to obtain and maintain a DOE Q clearance Qualifications We Desire Knowledge of project and portfolio management processes in order to support the Project Management Organization Experience developing or maintaining software written using C#, Java, Javascript, CSS, ASP.NET applications, SQL, PL/SQL, or Transact SQL Experience executing project management tools/methodologies (e.g, Kanban, Agile, Extreme Programming) Demonstrate strong critical thinking, synthesis and problem-solving skills, and ability to see and convey the big picture Ability to deal with ambiguity and adapt to a fast-paced, customer-focused operation Strong oral, written and interpersonal skills and ability to work effectively in diverse team environments Demonstrated ability to manage and prioritize a variety of tasks and work independently with minimal supervision Ability to organize and perform under strict deadlines and changing priorities Willing to take initiative, take ownership of job responsibilities, and make appropriate decisions to complete tasks Current DOE or DOD clearance About Our Team The Sandia Enterprise Project Management Team, Department 9743, operates and maintains enterprise project management and earned value tools used to plan, implement, monitor, and report cost, schedule, scope, risk, and other project management work. These tools provide effective program/project management for the Corporation in collaboration with the Sandia Earned Value Management Systems Office (SEO). These systems also ensure Sandia operates and meets the requirements of an effective Earned Value Management System (EVMS).<br><br>Posting Duration This posting will be open for application submissions for a minimum of seven (7) calendar days, including the posting date. Sandia reserves the right to extend the posting date at any time. Security Clearance Sandia is required by DOE to conduct a pre-employment drug test and background review that includes checks of personal references, credit, law enforcement records, and employment/education verifications.<br><br>Applicants for employment need to be able to obtain and maintain a DOE Q-level security clearance, which requires U.S. citizenship. If you hold more than one citizenship (i.e., of the U.S.<br><br>and another country), your ability to obtain a security clearance may be impacted. Applicants offered employment with Sandia are subject to a federal background investigation to meet the requirements for access to classified information or matter if the duties of the position require a DOE security clearance. Substance abuse or illegal drug use, falsification of information, criminal activity, serious misconduct or other indicators of untrustworthiness can cause a clearance to be denied or terminated by DOE, resulting in the inability to perform the duties assigned and subsequent termination of employment.<br><br>EEO All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or veteran status and any other protected class under state or federal law. NNSA Requirements for MedPEDs If you have a Medical Portable Electronic Device (MedPED), such as a pacemaker, defibrillator, drug-releasing pump, hearing aids, or diagnostic equipment and other equipment for measuring, monitoring, and recording body functions such as heartbeat and brain waves, if employed by Sandia National Laboratories you may be required to comply with NNSA security requirements for MedPEDs. If you have a MedPED and you are selected for an on-site interview at Sandia National Laboratories, there may be additional steps necessary to ensure compliance with NNSA security requirements prior to the interview date",
        "link": "https://zobjobs.com/job/software-systems-engineer-experienced-remote-job-in-usa-zj6hqqpmnqhj",
        "category": [
            "Systems Engineer"
        ],
        "location": "United States US",
        "country": "US"
    },
    {
        "created": "2023-07-21T06:43:58+00:00",
        "expires": "2023-08-17T06:33",
        "sourced": "public domain",
        "unique": 1252399,
        "companyName": "General Mills",
        "companyUrl": "https://zobjobs.com/company/false",
        "title": "Sr. Systems Engineer I-Geneva, Illinois",
        "description": "Job Description:<br><br>OVERVIEW<br><br>This posting is for a System Engineer who will provide support to our Geneva, IL Plant. The Geneva plant is currently an External Supply partner manufacturing plant which will convert to a GMI operation in early 2024.<br><br>This role will be reporting Mike Steding (System Improvement Team Manager) in the short term but will report to the Plant Technical Manager post internalization in early 2024.<br><br>The Geneva plant is currently a dry mix operation supporting Baking. Through the acquisition of the dry mix plant GMI is making significant investment for other platforms.<br><br>The System Engineer will partner with the dry mix External Supply Manufacture Partners and provide technical leadership in the areas of human safety, food safety, and system performance for the dry mix department at the Geneva, IL facility.<br><br>Prior to internalization, significant travel may be required to Geneva to learn the equipment, build training material, and help to prepare for a smooth transition.<br><br>Relocation to the Geneva, IL area will be required. Timing is flexible, prior to December 2023.<br><br>KEY ACCOUNTABILITIES<br><br>The System Engineer will be responsible for the following:<br>• Human and Food Safety<br>• Understand and provide expertise for human and food safety systems as they apply to manufacturing systems<br>• Technical Knowledge and Leadership<br>• Apply technical knowledge and leadership to solve problems and drive improvements on process and packaging systems<br>• Own the operation and improvement plans to the Processing, packaging, and distribution systems.<br>• Productivity/Cost Savings<br>• Identify and implement cost savings solutions to drive to Zero Loss. Partner with R&D, Quality, Operations, and Engineering/Maintenance to drive system improvements<br>• Product and Technology Commercialization<br>• Partner with R&D and project teams on tests, trials, and new products<br>• Future State Strategy<br>• Develop strategies for strategic improvements that are aligned with business needs on the packaging systems<br><br>MINIMUM QUALIFICATIONS<br>• 5 - 7 years related work experience in process and/or packaging engineering, process/ system development, product development, quality engineering, or manufacturing.<br>• Demonstrated technical leadership, problem-solving, decision making, trouble-shooting, communications, and interpersonal skills.<br>• Demonstrates ability to coach and build capability in line teams and operators/mechanics.<br>• Recognized technical abilities and practical experience with capabilities in the following areas:<br>• Theory/functionality of manufacturing systems and unit operations<br>• Data and manufacturing performance metrics analysis<br>• Continuous improvement techniques (Lean, TPM, Kaizen)<br>• Loss Prioritization/Quantification and Elimination<br>• Coaching and Training capability<br>• Process measurement and controls to optimize system and unit operation performance<br>• Mechanical aptitude<br>• Problem Solving and Root Cause Analysis<br>• General engineering principles<br>• Demonstrates ability to work with and influence diverse groups at various levels and across functions.<br>• Strong ability to involve operators and mechanics in the project process.<br>• Must have a good understanding of packaging and processing systems along with working knowledge of plant manufacturing, engineering, quality, and research functions.<br>• Good understanding of Zero Loss Culture principles.<br><br>PREFERRED QUALIFICATIONS<br>• Bachelor of Science degree in Engineering or related degree with applicable experience or extensive relevant work experience<br>• Mechanical, Electrical, or Chemical Engineering degrees preferred.<br>• Demonstrates:<br>• Leadership<br>• Influence management<br>• Collaborative team player<br>• Self-Starter<br><br>Company Overview:<br><br>We exist to make food the world loves. But we do more than that. Our company is a place that prioritizes being a force for good, a place to expand learning, explore new perspectives and reimagine new possibilities, every day. We look for people who want to bring their best — bold thinkers with big hearts who challenge one other and grow together. Because becoming the undisputed leader in food means surrounding ourselves with people who are hungry for what’s next",
        "link": "https://zobjobs.com/job/sr-systems-engineer-igeneva-illinois-job-in-usa-zj6hqqpmmf3e",
        "category": [
            "Systems Engineer",
            "systems engineer"
        ],
        "location": "United States US",
        "country": "US"
    },
    {
        "created": "2023-07-21T06:43:58+00:00",
        "expires": "2023-08-17T06:33",
        "sourced": "public domain",
        "unique": 1252398,
        "companyName": "Rockstar Games",
        "companyUrl": "https://zobjobs.com/company/false",
        "title": "Windows Systems Engineer (All Levels)",
        "description": "At Rockstar Games, we create world-class entertainment experiences.<br><br>A career at Rockstar Games is about being part of a team working on some of the most creatively rewarding and ambitious projects to be found in any entertainment medium. You would be welcomed to a dedicated and inclusive environment where you can learn, and collaborate with some of the most talented people in the industry.<br><br>Rockstar New York is looking for a talented Systems Engineer who has a strong understanding of Windows systems and an inclination to automate repetitive tasks and develop tooling. This is a full-time permanent position based out of Rockstar’s unique game studio in the heart of downtown Manhattan.<br><br>WHAT WE DO<br>• We work closely with developers, DBAs, build engineers, and security teams.<br>• We build world-class infrastructure for our high traffic, high visibility web sites and services.<br>• We provide operational support for critical services that enable connected experiences found across our game franchises.<br>• We constantly review our processes, automate wherever possible, and develop our own toolchains.<br><br>RESPONSIBILITIES<br>• Build and maintain Windows servers and associated applications in a highly available, public facing environment.<br>• Manage and support .NET/ASP.NET web sites and services.<br>• Automate workflows and contribute to our significant PowerShell/DSC/Chef codebase.<br>• Perform root cause analysis through multiple infrastructure layers.<br>• Build and support SQL Server 2019 failover clusters.<br>• Manage storage systems including Pure Storage, Compellent, and Brocade hardware.<br>• Manage VMware clusters.<br>• Administer monitoring systems such as CheckMK, Splunk, Grafana.<br>• Provide timely and creative solutions to difficult problems.<br>• Respond to critical off-hours requests in an on-call rotation.<br><br>QUALIFICATIONS<br>• Experience managing highly distributed, Windows-based, production environments.<br>• Thorough understanding of Windows Server operating system internals.<br>• Proficient in a high-level language like PowerShell or Python to automate tasks.<br>• Experience with configuration management or infrastructure as code (Chef preferred).<br>• Strong experience with VMware, IIS, and SQL Server.<br>• Strong understanding of TCP/IP networking and HTTP.<br><br>PLUSES<br><br>Please note that these are desirable skills and are not required to apply for the position.<br>• Bachelor’s Degree in Computer Science, Information Systems, Engineering or equivalent experience.<br>• Experience supporting online gaming development and production environments.<br>• Linux administration – preferably LAMP stack.<br>• Experience with containerization technology (preferably Docker).<br>• General Cisco administration experience for tagging VLANs, configuring ACLs.<br>• Knowledge of C#.<br><br>HOW TO APPLY<br><br>Please apply with a resume and cover letter demonstrating how you meet the skills above. If we would like to move forward with your application, a Rockstar recruiter will reach out to you to explain next steps and guide you through the process.<br><br>Rockstar is proud to be an equal opportunity employer, and we are committed to hiring, promoting, and compensating employees based on their qualifications and demonstrated ability to perform job responsibilities.<br><br>If you’ve got the right skills for the job, we want to hear from you. We encourage applications from all suitable candidates regardless of age, disability, gender identity, sexual orientation, religion, belief, or race",
        "link": "https://zobjobs.com/job/windows-systems-engineer-all-levels-job-in-usa-zj6hqqpmmdlj",
        "category": [
            "Systems Engineer",
            "systems engineer"
        ],
        "location": "United States US",
        "country": "US"
    },
    {
        "created": "2023-07-21T06:43:58+00:00",
        "expires": "2023-08-17T06:33",
        "sourced": "public domain",
        "unique": 1252397,
        "companyName": "TekSynap",
        "companyUrl": "https://zobjobs.com/company/false",
        "title": "Systems Engineer Jobs",
        "description": "<b> Responsibilities & Qualifications </b><br><br><strong>RESPONSIBILITIES</strong><br><br>The Sponsor requires a team of security engineers to provide Security Engineering to ensure properly secured systems and compliance with all Sponsor cyber policies and processes. <br><ul><li>Provide technical consultation in support of architecture reviews, accreditation activities, vulnerability assessments, baseline configuration changes, privilege access, and software and services requests. </li><li>Liaison to the Sponsor's security support elements to include incident reporting and compliance. </li><li>The supported environment includes: a virtual desktop environment, roughly, 60 engineers and developers leverage the environment, not including system users, data scientists or analysts; Dev/test/prod environment on the sponsors primary network and joint integration network with Government partners; a mix of physical enclaves (including network equipment) and virtual VPCs segregating the system from the Sponsor's and Partner's general use LAN/WAN environments; and any changes to promote new requirements and the future strategy to minimize the physical footprint by leveraging multi-vendor cloud technologies to provide timely and scalable throughput for data scientists and analysts.</li></ul><br><strong> REQUIRED QUALIFICATIONS </strong><br><br><ul><li>Active TS/SCI + Poly</li><li>Master's degree and 15 years of experience. Work experience can be used/combined with education</li><li>Experience performing risk analysis and assessments on cloud based systems and hybrid architectures to include Java based applications.</li><li>Experience complying with to ICD 503 Risk Management Framework. Demonstrated experience reviewing vulnerability assessments utilizing such tools as Xacta, Rapid 7, Web Inspect, and AppDetective.</li><li>Experience developing, implementing, and maintaining security support structures utilizing Linux and Windows technologies and HADOOP Ecosystems.</li><li>Experience assisting with the design, engineering, and development of highly secure systems built upon Amazon Web Services.</li><li>Experience producing metrics, performing continuous security monitoring, and developing strategies for remediation using Splunk or similar solutions.</li><li>Experience participating in architecture design and reviews</li></ul><br><strong>DESIRED QUALIFICATIONS</strong><br><br><ul><li>Experience with Big Data using underlying technologies such as HADOOP clusters.</li><li>Experience with Linux administration.</li><li>Experience applying new technologies.</li><li>Experience with multiple cloud vendors (i.e. Azure, Oracle, Google).</li></ul><br><strong>DESIRED CERTIFICATONS</strong><br><br><ul><li>information Systems Security Engineering Professional (ISSEP) Certification.</li><li>Information Systems Security Professional (CISSP) Certification</li><li>Certified Cloud Security Professional (CCSP)</li></ul> <br><br><b> Overview </b><br><br>We are seeking a Systems Engineer to join our team in Herndon, VA.<br><br>TekSynap is a fast growing high-tech company that understands both the pace of technology today and the need to have a comprehensive well planned information management environment. \"Technology moving at the speed of thought\" embodies these principles - the need to nimbly utilize the best that information technology offers to meet the business needs of our Federal Government customers.<br><br>We offer our full-time employees a competitive benefits package to include health, dental, vision, 401K, life insurance, short-term and long-term disability plans, vacation time and holidays. <br><br>Visit us at  www.TekSynap.com . <br><br>Apply now to explore jobs with us! <br><br>The safety and health of our employees is of the utmost importance. Employees are required to comply with any contractually mandated Federal COVID-19 requirements. More information can be found here .<br><br>By applying to a role at TekSynap you are providing consent to receive text messages regarding your interview and employment status. If at any time you would like to opt out of text messaging, respond \"STOP\".<br><br><b> Additional Job Information </b><br><br><strong> COMPETENCIES  </strong><br><br><ul><li>Establish Focus</li><li>Change Management</li><li>Develop Others</li><li>Oral Communication </li><li>Written Communication </li><li>Interpersonal Awareness</li><li>Build Relationships</li><li>Analytical Thinking</li><li>Conceptual Thinking</li><li>Strategic Thinking</li><li>Technical Expertise</li><li>Initiative</li><li>Foster Innovation</li><li>Results Oriented</li><li>Teamwork </li><li>Customer Service</li></ul><br><strong> WORK ENVIRONMENT AND PHYSICAL DEMANDS </strong><br><br>The work environment characteristics described here are representative of those an employee encounters while performing the essential functions of the job. Reasonable accommodation may be made to enable individuals with disabilities to perform the essential functions. <br><ul><li>Location: Herndon, VA</li><li>Type of environment: Office</li><li>Noise level: Medium</li><li>Work schedule: Schedule is Monday- Friday, dayshift. May be requested to work evenings and weekends to meet program and contract needs.</li><li>Amount of Travel: Less than 10%</li></ul><br><strong> PHYSICAL DEMANDS </strong><br><br>The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br><br>While performing the duties of this job, the employee is regularly required to use hands to handle, feel, touch; reach with hands and arms; talk and hear. The employee is regularly required to stand; walk; sit; climb or balance; and stoop, kneel, crouch, or crawl. The employee is regularly required to lift up to 10 pounds. The employee is frequently required to lift up to 25 pounds; and up to 50 pounds. The vision requirements include close vision, distance vision, peripheral vision, depth perception, and ability to adjust focus.<br><br><strong> WORK AUTHORIZATION/SECURITY CLEARANCE </strong><br><br>US. Citizen<br><br>Active TS/SCI + Poly Clearance<br><br><strong> OTHER DUTIES </strong><br><br>Please note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice.<br><br><strong> EQUAL EMPLOYMENT OPPORTUNITY </strong><br><br>In order to provide equal employment and advancement opportunities to all individuals, employment decisions will be based on merit, qualifications, and abilities. TekSynap does not discriminate against any person because of race, color, creed, religion, sex, sexual orientation, gender identity, protected veteran status, national origin, disability, age, genetic information or any other characteristic protected by law (referred to as \"protected status\"). This nondiscrimination policy extends to all terms, conditions, and privileges of employment as well as the use of all company facilities, participation in all company-sponsored activities, and all employment actions such as promotions, compensation, benefits, and termination of employment.<br><br>TekSynap is committed to ensuring that our online application process provides an equal employment opportunity to all job seekers, including individuals with disabilities. If you believe you need a reasonable accommodation in order to search for a job opening or to submit an application, please contact hr@teksynap.com for assistance.",
        "link": "https://zobjobs.com/job/systems-engineer-jobs-job-in-usa-zj6hqqpmmccc",
        "category": [
            "Systems Engineer",
            "systems engineer"
        ],
        "location": "Herndon VA United States US",
        "country": "US"
    },
    {
        "created": "2023-07-21T06:43:58+00:00",
        "expires": "2023-08-17T06:33",
        "sourced": "public domain",
        "unique": 1252396,
        "companyName": "Palo Alto Networks",
        "companyUrl": "https://zobjobs.com/company/false",
        "title": "Systems Engineer, Pre Sales ( USAF / East Coast - Mid Atlantic Territory )",
        "description": " <p>  <strong> Our Mission </strong>  <br> \n <br> \nAt Palo Alto Networks® everything starts and ends with our mission: <br> \n <br> \nBeing the cybersecurity partner of choice, protecting our digital way of life. <br> \n <br> \nWe have the vision of a world where each day is safer and more secure than the one before. These aren’t easy goals to accomplish – but we’re not here for easy. We’re here for better. We are a company built on the foundation of challenging and disrupting the way things are done, and we’re looking for innovators who are as committed to shaping the future of cybersecurity as we are. <br> \n <br> \nWe’re changing the nature of work. Palo Alto Networks is evolving to meet the needs of our employees now and in the future through FLEXWORK, our approach to how we work. From benefits to learning, location to leadership, we’ve rethought and recreated every aspect of the employee experience at Palo Alto Networks.&#xa0; And because it FLEXes around each individual employee based on their individual choices, employees are empowered to push boundaries and help us all evolve, together. </p>  <p>  <strong> Your Career </strong>  <br> \n <br> \nAs a Systems Engineer you provide technical expertise and guidance in your customer’s zero trust journey. &#xa0;You will play a key role in defining technical solutions that secure a customer’s key business imperatives. &#xa0;You evangelize our industry leadership in on-prem, cloud, and security services that establish PANW as your customer’s cybersecurity partner of choice. <br> \n <br> \n <strong> Your Impact </strong>  <br> \n <br> \nCuriosity is core to the SE role, and you see complex problems as opportunities to learn and deliver innovative solutions! You define your impact by: </p>  <ul>  <li> Meeting and exceeding sales quotas by building and implementing strategic, technical account plans that target cross-platform solutions&#xa0; </li>  <li> Conducting discovery to understand and articulate the key technical, operational, and commercial imperatives of your prospects and customers </li>  <li> Planning and building compelling technical and business-focused solutions which drive adoption and growth after the initial sale and across the portfolio </li>  <li> Demonstrating strong communication skills and the ability to influence through effective presentations and customer-specific demos, technical engagements, and workshops </li>  <li> Orchestrating supporting resources to ensure a one-team approach that demonstrates a cohesive strategy </li>  <li> Promoting end-to-end solutions that include PANW and/or partner professional services to ensure customers realize business value sooner </li>  <li> Understanding the competitive landscape and effectively differentiate our leadership&#xa0; </li>  <li> Continuously investing in yourself to develop technical and professional skills that drive your ever-increasing contributions to customer success while actively participating within the SE community and at industry events <br> \n&#xa0; </li>  </ul>  <ul>  <li> Experience with and understanding of Air Force Programs &&#xa0;Command Structures is required.&#xa0;&#xa0; </li>  <li> Willingness to travel to meet with Air Force customers in multiple&#xa0;East Coast / Mid Atlantic locations is required.&#xa0;&#xa0; </li>  <li> Candidates residing with the Mid Atlantic East Coast region are highly preferred.&#xa0; </li>  <li> Top Secret(TS) clearance is preferred, but clearable candidates will be considered.&#xa0; </li>  <li> Thorough understanding of data networking & cybersecurity is required.&#xa0; </li>  <li> Experience delivering cybersecurity solutions that solve technical challenges and influence new business initiatives. </li>  <li> Experience influencing and gaining buy-in from key stakeholders, either in a customer-facing or internal role; prior experience in a pre-sales role is ideal </li>  <li> Experience creating and delivering technical presentations, workshops, or technical validation engagements&#xa0; </li>  <li> Experience selling, implementing, or managing SaaS/SASE/cloud/managed/on-prem offerings is a plus </li>  <li> Partnering with Customer Support functions to ensure successful implementation and adoption of sold solutions </li>  <li> Complex sales involving long sales processes with multiple buying centers and multi-product solutions is preferred.&#xa0; </li>  </ul>  <p>  <strong> The Team </strong>  <br> \n <br> \nOur SE team members work hand-in-hand with large organizations around the world to keep their digital environments protected. We educate, inspire,and empower our potential clients in their journey to security.&#xa0; </p>  <p> You are empowered with unmatched systems and tools and a team built on joint success. You won’t find someone at Palo Alto Networks that isn’t committed to your success – with everyone pitching in to assist when it comes to solutions selling, learning, and development. Our Systems Engineering community is driven by the mission to be our customers’ cybersecurity partner of choice, protecting their digital way of life.&#xa0; </p>  <p>  <strong> Our Commitment </strong>  </p>  <p> We’re trailblazers that dream big, take risks, and challenge cybersecurity’s status quo. It’s simple: we can’t accomplish our mission without diverse teams innovating, together. </p>  <p> We are committed to providing reasonable accommodations for all qualified individuals with a disability. If you require assistance or accommodation due to a disability or special need, please contact us at accommodations@paloaltonetworks.com. </p>  <p> Palo Alto Networks is an equal opportunity employer. We celebrate diversity in our workplace, and all qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or other legally protected characteristics. </p>  <br> ",
        "link": "https://zobjobs.com/job/systems-engineer-pre-sales-usaf-east-coast-mid-atlantic-territory-job-in-usa-zj6hqqpmljs1",
        "category": [
            "Systems Engineer",
            "systems engineer"
        ],
        "location": "Huntsville US",
        "country": "US"
    },
    {
        "created": "2023-07-21T06:43:58+00:00",
        "expires": "2023-08-17T06:32",
        "sourced": "public domain",
        "unique": 1252395,
        "companyName": "VTG",
        "companyUrl": "https://zobjobs.com/company/false",
        "title": "Senior Systems Integration Engineer",
        "description": "<strong>Overview</strong><br><br><p style=\"margin: 0px;\"><span style=\"font-family: arial, helvetica, sans-serif; font-size: 10pt;\">VTG is seeking a <strong>Senior Systems Integration Engineer</strong> to perform Technical Support, Analysis, Risk Management, and conduct Business and Technical support to our customer at <strong>Wright-Patterson Air Force Base (WPAFB)</strong>. This position is onsite.</span></p> <br><strong>What will you do?</strong><br><br><p style=\"margin: 0px;\"><span style=\"font-size: 10pt; font-family: arial, helvetica, sans-serif;\">Plan for and perform systems engineering activities and tasks IAW the provisions of the latest version of AFLCMC Engineering Directorate (AFLCMC/EZ) Systems Engineering Guide, applicable Headquarters Air Force Materiel Command (HQ AFMC) and applicable Division policies. Review, evaluate, and make recommendations regarding integrating technical requirements contained in USG directives. Assist in ensuring that technical specifications and standards are prepared IAW MIL-STD-961E and AFLCMC/EN Systems Engineering Guide as well as coordinate, integrate, and form an overall systems engineering perspective. Provide systems engineering technical support, system security engineering technical support, and recommendations of technical tasking assignments for the systems engineering functions. Provide recommendations for appropriate systems engineering input to: Fed Biz Ops submittals, MIL-STD-961E Performance / System Specifications, derived requirements and verification methods, SOOs, SOWs, Data Item Descriptions (DIDs), CDRLs, Instructions to Offerors (ITOs), RFPs, and source selection evaluation standards and elements.</span></p><p style=\"margin: 0px;\">&nbsp;</p><p style=\"margin: 0px;\"><span style=\"font-family: arial, helvetica, sans-serif; font-size: 10pt;\"><strong>Engineering Overview </strong></span></p><p style=\"margin: 0px;\"><span style=\"font-size: 10pt; font-family: arial, helvetica, sans-serif;\">Provide support of the acquisition, development, or sustainment of weapon systems, subsystems, and support equipment. Provide technical assistance to the IPTs as it relates to Operational Safety, Suitability, & Effectiveness (OSS&E). The Contractor shall review Engineering Change Proposals (ECP), Requests for Deviation (RFD), and maintain system configuration baselines. Participate in Technology Insertion discussions, Configuration Control Boards (CCB), and Technical & Programmatic Reviews. Assist in performing Failure Analysis and the production of economical solutions to improve System Reliability, Maintainability, and Availability. Areas of support include:</span></p><ul><li><span style=\"font-size: 10pt; font-family: arial, helvetica, sans-serif;\">Engineering Operations</span></li><li><span style=\"font-size: 10pt; font-family: arial, helvetica, sans-serif;\">Requirements Development</span></li><li><span style=\"font-size: 10pt; font-family: arial, helvetica, sans-serif;\">System Design</span></li><li><span style=\"font-size: 10pt; font-family: arial, helvetica, sans-serif;\">Analysis</span></li><li><span style=\"font-size: 10pt; font-family: arial, helvetica, sans-serif;\">Schedule</span></li><li><span style=\"font-size: 10pt; font-family: arial, helvetica, sans-serif;\">Integration</span></li><li><span style=\"font-size: 10pt; font-family: arial, helvetica, sans-serif;\">Lifecycle</span></li><li><span style=\"font-size: 10pt; font-family: arial, helvetica, sans-serif;\">Management Operations</span></li><li><span style=\"font-size: 10pt; font-family: arial, helvetica, sans-serif;\">Data Item Evaluation</span></li><li><span style=\"font-size: 10pt; font-family: arial, helvetica, sans-serif;\">Document Preparation/Evaluation</span></li><li><span style=\"font-size: 10pt; font-family: arial, helvetica, sans-serif;\">Technical Planning and Support</span></li><li><span style=\"font-size: 10pt; font-family: arial, helvetica, sans-serif;\">Document Development/Management</span></li><li><span style=\"font-size: 10pt; font-family: arial, helvetica, sans-serif;\">Program Protection Program</span></li></ul><p style=\"margin: 0px;\"><span style=\"font-family: arial, helvetica, sans-serif; font-size: 10pt;\"><strong>&nbsp;</strong></span></p><p style=\"margin: 0px;\"><span style=\"font-family: arial, helvetica, sans-serif; font-size: 10pt;\"><strong>Systems Integration </strong></span></p><ul><li><span style=\"font-size: 10pt; font-family: arial, helvetica, sans-serif;\">Have knowledge of systems engineering in support of system definition, development, integration, verification methods, sustainment, risk modeling/simulation, testing and evaluation, human system integration (HSI), crew stations engineering, OSS&E efforts, interoperability requirements, and airworthiness certification across a wide range of hardware and software systems, including ground based systems. </span></li><li><span style=\"font-size: 10pt; font-family: arial, helvetica, sans-serif;\">Assist in reviewing, developing and updating applicable program documentation for systems engineering relevant requirements/issues. </span></li><li><span style=\"font-size: 10pt; font-family: arial, helvetica, sans-serif;\">Participate in and assist in the planning of systems engineering risk assessments by establishing a risk management review, coordinating action item status, and updating risk management metrics. </span></li><li><span style=\"font-size: 10pt; font-family: arial, helvetica, sans-serif;\">Support the program office Airworthiness Certification Working Group (ACWG) by assisting in the development and maintenance of a comprehensive Modification Airworthiness Criteria Certification (MACC) compliance package as well as the airworthiness risk assessment. </span></li><li><span style=\"font-size: 10pt; font-family: arial, helvetica, sans-serif;\">Support the planning and execution of the Airworthiness Review Board Meeting in support of obtaining military flight releases/Military Type Certificates. </span></li><li><span style=\"font-size: 10pt; font-family: arial, helvetica, sans-serif;\">Assist in the production of draft documentation as requested or necessitated by programmatic limits based on cost, schedule, and performance to support the airworthiness process.</span></li><li><span style=\"font-size: 10pt; font-family: arial, helvetica, sans-serif;\">Assist in reviewing and performing assessments on program specific databases; analyze Built in Test (BIT) failure reports; and compare failure reports against the BIT Interpreter Analyzer for accuracy of BIT indications; provide system integration guidance to aircraft program offices for the program system installation and system maintenance; review and analyze technical proposals. </span></li><li><span style=\"font-size: 10pt; color: black; font-family: arial, helvetica, sans-serif;\">Assist in the review of Failure Reporting, Analysis, and Corrective Action System (FRACAS) and Reliability Standard Reports; work with G081 database to check failure reporting from the field; and assist in the handling of all DRs ensuring proper classification and adequate detail for resolution.</span></li></ul> <br><strong>Do you have what it takes?</strong><br><br><ul><li style=\"margin-bottom: 0in;\"><span style=\"font-size: 10pt; color: black; font-family: arial, helvetica, sans-serif;\">Possess the advanced knowledge, experience and recognized ability to be considered an expert in their technical/professional field, possesses the ability to perform tasks, and oversee the efforts of junior and journeyman personnel within the technical/professional discipline; demonstrate advanced knowledge of their technical/professional discipline as well as possess a comprehensive understanding and ability to apply associated standards, procedures and practices in their area of expertise. A Senior skill level typically works on high-visibility or mission critical aspects of a given program and performs all functional duties independently. </span></li><li style=\"margin-bottom: 0in;\"><span style=\"font-size: 10pt; color: black; font-family: arial, helvetica, sans-serif;\">Minimum Education and Experience is a MA/MS in engineering and ten years of experience in Engineering programs or,</span></li><li style=\"margin-bottom: 0in;\"><span style=\"font-size: 10pt; color: black; font-family: arial, helvetica, sans-serif;\">An ABET-accredited Bachelor&rsquo;s degree in engineering and twenty years of experience in Engineering programs.</span></li></ul><p style=\"margin: 0px;\"><span style=\"font-family: arial, helvetica, sans-serif; font-size: 10pt;\"><strong><span style=\"color: black;\">Travel:</span></strong> 25%</span></p><p style=\"margin: 0px;\">&nbsp;</p><p style=\"margin: 0px;\"><span style=\"font-family: arial, helvetica, sans-serif; font-size: 10pt;\"><strong>Clearance</strong>: Active Secret Security Clearance</span></p><p style=\"margin: 0px;\">&nbsp;</p>",
        "link": "https://zobjobs.com/job/senior-systems-integration-engineer-systems-engineer-job-in-usa-zj6hqqpmi2vq",
        "category": [
            "Systems Engineer",
            "systems engineer"
        ],
        "location": "Dayton Ohio United States US",
        "country": "US"
    },
    {
        "created": "2023-07-21T06:43:58+00:00",
        "expires": "2023-08-17T06:32",
        "sourced": "public domain",
        "unique": 1252394,
        "companyName": "GeoLogics Corporation",
        "companyUrl": "https://zobjobs.com/company/false",
        "title": "Senior Principal Systems Engineer Jobs",
        "description": "<strong>Senior Principal Systems Engineer job in Scottsdale, Arizona is available with GeoLogics top Aerospace & Defense company. In this job you will </strong>participate in requirements analysis, management, functional analysis, performance analysis, system design, trade studies, systems integration and test (verification) in the development and evaluation of networks and information systems.<br><br><b>Required Skills & Experience</b><br><br><ul><li>U.S. Citizen ability to obtainDepartment of Defense Top Secret security clearance </li><li>Bachelor's degree in Systems Engineering, or a related Science, Engineering or Mathematics field. Also requires 10+ years of job-related experience, or a Master's degree and 8+ years of experience. </li><li>Substantial proficiency with requirements management & system modeling tools</li><li>DevSecOps experience with some of the following platform/tools: AWS, GitLab, Kubernetes, Docker, Jenkins, Ansible and Terraform</li><li>CI/CD pipeline development and Test automation</li><li>Missile Warning/Missile Tracking system integration, test, operations experience</li><li>Familiar with Agile philosophies and processes</li></ul><br><strong>Brian Videtic</strong><br><br>Senior Recruiter<br><br>(703) 891-6119<br><br>bvidetic@geologics.com<br><br>#CJ<br><br> 'In compliance with the Equal Pay for Equal Work Act, the W2 hourly rate range for this role is $65.00 - $110.00. Rates listed are not a guarantee of salary/rate. Rate offered at time of hire will depend on many factors including education, experience, interview results and skill level. GeoLogics offers a variety of benefits including: wellness and disability insurance, 401(k), flexible spending accounts, EAP, and PTO. The specific programs and options available to an employee may vary depending on date of hire, schedule type, and the program requirements.' GeoLogics is an Equal Opportunity/Affirmative Action Employer that is committed to hiring a diverse and talented workforce. EOE/Disability/Veteran.",
        "link": "https://zobjobs.com/job/senior-principal-systems-engineer-jobs-job-in-usa-zj6hqqpmhvvg",
        "category": [
            "Systems Engineer",
            "systems engineer"
        ],
        "location": "Scottsdale AZ United States US",
        "country": "US"
    },
    {
        "created": "2023-07-21T06:43:58+00:00",
        "expires": "2023-08-17T06:23",
        "sourced": "public domain",
        "unique": 1252393,
        "companyName": "ASRC Federal Holding Company",
        "companyUrl": "https://zobjobs.com/company/false",
        "title": "Senior .Net Developer - Active Secret",
        "description": "ASRC Federal Holding Company is a premier provider of systems and solutions for a wide variety of federal government customers. We are seeking motivated Senior .NET Developer to join our team in developing mission critical agency systems in a dynamic, agile environment.<br><br>Location: Sterling, VA (flexible to work at DEA HQ in Arlington, VA<br><br>Work arrangement: Hybrid (up to 3 days onsite)<br><br>Clearance: Interim or Active Secret clearance<br><br>Responsibilities:<br>• Develop mission critical applications in support of the Drug Enforcement Agency (DEA) mission<br>• Work collaboratively in an Agile software development environment<br>• Apply modern software development techniques for a modular system<br>• Have an ability to learn new technologies as they are introduced, and the software applications and environment evolves<br>• Support modernization of software development practices<br>• Contribute to enterprise best practices and playbooks<br>• Identify and support opportunities for innovation<br>• Lead and mentor junior personnel<br>• Contribute to system design and architectural decision making<br><br>In addition to directly building critical government systems, you have ability to connect with ASRC Federal Centers of Excellence offers you a unique ability to expand and grow through:<br>• Research and Development initiatives<br>• Internal technical competitions<br>• Cross-domain Subject Matter Expertise (SME) Collaboration<br>• Innovation and technology exploration<br>• Professional development, training, and tuition reimbursement programs<br><br>This is a versatile opportunity to join a people-focused organization and to work with an established team in a flexible and enjoyable work environment while making significant impact to customers.<br><br>Requirements:<br>• Ten (10) years of overall development experience that includes at least 5+ years with ASP.NET MVC based web development using Visual Studio.<br>• Five (5) years of Agile development methodology experience<br>• Experience in web development using ASP .NET, JavaScript, C#, AJAX, HTML, CSS, XML, or similar<br>• Understanding of legacy .Net technology such as ASP .Net MVC and entity framework<br>• Experience with Relational Database Management Systems (RDBMS) using technologies such as SQL and Oracle<br>• Experience with Agile software development techniques<br>• Understanding of DevOps<br>• Experience with automated test frameworks<br>• Excellent communication and collaboration skills<br>• Excels in a team environment<br>• Driven to grow and improve both yourself and the company<br>• Must be a U.S. Citizen with an interim or active Secret clearance<br>• Applicants selected will be subject to a Government security background investigation and must meet eligibility and DEA suitability requirements.<br><br>Preferred:<br>• Experience developing large enterprise custom web applications<br>• Experience working in a federal government environment<br><br>Equal Opportunity Employer Minorities/Women/Protected Veterans/Disabled",
        "link": "https://zobjobs.com/job/senior-net-developer-active-secret-job-in-usa-zj6hqqplo1vm",
        "category": [
            ".Net",
            ".NET"
        ],
        "location": "United States US",
        "country": "US"
    },
    {
        "created": "2023-07-21T06:43:58+00:00",
        "expires": "2023-08-17T06:23",
        "sourced": "public domain",
        "unique": 1252392,
        "companyName": "Macquarie Group",
        "companyUrl": "https://zobjobs.com/company/false",
        "title": ".NET Developer",
        "description": "Macquarie Group is offering an exciting opportunity for a .NET developer to join a front-office team supporting pre-trade analytics applications. This is a client-facing and highly visible role supporting commodities traders in both Houston and Macquaries global locations.You will work alongside stakeholders and the engineering team to uplift existing application suite. You will be engaged in all phases of software development, including design, implementation, testing, release and application support. We have a people-centered culture, which means we want to hear your ideas. You will be empowered to research, evaluate and present recommendations for software solutions.<br><br>Macquarie Group is offering an exciting opportunity for a .NET developer to join a front-office team supporting pre-trade analytics applications. This is a client-facing and highly visible role supporting commodities traders in both Houston and Macquaries global locations.<br><br>You will work alongside stakeholders and the engineering team to uplift existing application suite. You will be engaged in all phases of software development, including design, implementation, testing, release and application support. We have a people-centered culture, which means we want to hear your ideas. You will be empowered to research, evaluate and present recommendations for software solutions.<br><br>Developing our teams is important at Macquarie and you can impact our team by mentoring, learning and building reusable code. Our online learning platform allows you to build both technical and soft skills. You can connect with others, in the office or online, through our employee network groups and regional programs.<br><br>Were looking for someone with the following experience and skills to join our team:<br>• Bachelors degree in Computer Science or a related field<br>• 3+ years experience in C# .NET Windows development<br>• 3+ years experience in UI development<br>• Familiarity with SQL/PL-SQL<br>• Ability to navigate custom business workflows and modernize DevOps processes<br>• A strong customer focus and a willingness to own the end-to-end delivery of business value<br>• Ability to communicate problems and solutions effectively with business and technical stakeholders.<br>• A self-motivated, inquisitive and methodical style of problem-solving<br>• Capacity to handle multiple tasks to support the traders and other business users<br>• Good understanding of data structures, design patterns and algorithms<br>• Agile methodology and practices<br>• Eagerness to learn new technologies<br><br>It will be additionally helpful if you have the following skills/experience:<br>• Financial trading systems<br>• Winforms / ASP.NET / VBA<br>• Familiarity with cloud technologies (e.g., AWS, PostgreSQL, Redshift)<br><br>About the Corporate Operations Group<br><br>The Corporate Operations Group brings together specialist support services in Digital Transformation & Data, Technology, Operations, Human Resources, Business Services, Corporate Strategy & Solutions, and the Macquarie Group Foundation. We deliver service excellence to ensure Macquarie is open for business, deliver on transformational change, invest in our people and have deep relationships with our customers.<br><br>Our commitment to Diversity, Equity and Inclusion<br><br>The diversity of our people is one of our greatest strengths. An inclusive and equitable workplace enables us to embrace that diversity to deliver more innovative and sustainable solutions for our people, clients, shareholders and communities. At Macquarie, youll be encouraged to be yourself and supported to perform at your best. If youre inspired to deliver on our purpose of empowering people to innovate and invest for a better future, we want you on our team. If you need adjustments made to the recruitment process, please reach out to your recruiter.<br><br>All qualified applicants will receive consideration for employment and will not be discriminated against on the basis of race, color, religion, sex, sexual orientation, national origin, age, disability, protected veteran status, genetic information, marital status, gender identity or any other impermissible criterion or circumstance. Macquarie also takes affirmative action in support of its policy to hire and advance in employment of individuals who are minorities, women, protected veterans, and individuals with disabilities.<br><br>We equip our people with the support to work in a range of flexible ways. Talk to us about what working arrangements would help you thrive",
        "link": "https://zobjobs.com/job/net-developer-job-in-usa-zj6hqqplo1fm",
        "category": [
            ".Net",
            ".NET"
        ],
        "location": "United States US",
        "country": "US"
    },
    {
        "created": "2023-07-21T06:43:58+00:00",
        "expires": "2023-08-17T06:23",
        "sourced": "public domain",
        "unique": 1252391,
        "companyName": "Diverse Lynx",
        "companyUrl": "https://zobjobs.com/company/false",
        "title": "Sr. Dot Net Developer",
        "description": "New York NY Onsite<br><br>Required Qualifications<br><br> 6+ years Experience working with, ASP .NET, .NET Core, Angular 8+, jQuery, JavaScripts and other related technologies.<br><br> Hands-on experience with development of applications using ASP.NET, ADO.NET, C#, VB.NET, WCF, WPF, LINQ, Web API, Web Services, REST-Based Web APIs.<br><br> Hands on experience in Cloud platforms like Azure.<br><br> Experience in developing applications front end using Angular 12, DOM, DHTML, CSS3, Bootstrap, JavaScript framework, AJAX controls, jQuery<br><br> Strong understanding of SOLID design principles and exposure to Design Patterns like Singleton, Factory, Builder, Facade, Strategy, Template, etc.<br><br> Performance tuning for optimum results of online and batch processes<br><br> Good experience in developing enterprise-level Web Applications using n-Tier Architecture.<br><br> Understand and Document business requirements and system designs.<br><br> Develop Database objects (Stored Procedures, Functions, views, constraints etc )<br><br> Test Driven Development (TDD) in developing an application in an Agile (SCRUM) environment.<br><br> Extensively work with client-side validations by make use of the JavaScript and Angular 12 Framework.<br><br> Web Forms, ASP. Net State Management, ASP. Net Caching, Security.<br><br>Roles/Responsibilities<br><br> Designed and developed asp.net with integrated custom controls and user controls.<br><br> Hands on experience in using asp.net Ajax, JQuery, and .net controls like chart control.<br><br> Design and Develop complex and large-scale business applications.<br><br> Apply industry best practices.<br><br> Created, Deployed and Managed Reports using Crystal Reports.<br><br> Extensive use of AngularJS, UI-Grid, JSON, For MVC Pattern Application.<br><br> Deep understanding of OOP, Design Patterns,<br><br> Design, develop and Test Web Applications<br><br> Design and Develop Service, Contracts, Design Data Models.<br><br> Understand and Document business requirements and system designs.<br><br> Develop Database objects (Stored Procedures, Functions, views, constraints etc )<br><br> Monitor the system performance by performing regular tests, troubleshooting and integrating new features.<br><br>Diverse Lynx LLC is an Equal Employment Opportunity employer. All qualified applicants will receive due consideration for employment without any discrimination. All applicants will be evaluated solely on the basis of their ability, competence and their proven capability to perform the functions outlined in the corresponding role. We promote and support a diverse workforce across all levels in the company",
        "link": "https://zobjobs.com/job/sr-dot-net-developer-net-job-in-usa-zj6hqqplnrsf",
        "category": [
            ".Net"
        ],
        "location": "United States US",
        "country": "US"
    },
    {
        "created": "2023-07-21T06:43:58+00:00",
        "expires": "2023-08-17T06:22",
        "sourced": "public domain",
        "unique": 1252389,
        "companyName": "Revolution Technology",
        "companyUrl": "https://zobjobs.com/company/false",
        "title": "Lead FullStack Engineer",
        "description": "Position: Lead FullStack Engineer | Up to £100k<br><br>Lead Full stack Engineer | London, Hybrid | up to £100k | React/Angular & Python<br>Take the next step in your career now, scroll down to read the full role description and make your application.<br><br>One of the UKs largest home service providers with a business valuation of £100 Million are looking for the next Lead to join the team where you will come in and take control, driving their profitable platform forward.<br><br>You will propose your own take on the code and provide new features, improving not only your experience which will further your career, but the business itself.<br><br>The tech stack includes:<br>React, Angular, Next, Django, Python and Ionic.<br><br>This makes this role even more exciting as you will work with a variety of tech expanding your in-depth knowledge, leading to further career development.<br><br>Benefits:<br><br>-Share Options????<br><br>-Flexible Hours⏱<br><br>-Sponsored Events????<br><br>-Career Progression⬆<br><br>This is a great opportunity for a great company that should not be missed!<br><br>If you are interested, please apply for further details",
        "link": "https://zobjobs.com/job/lead-fullstack-engineer-full-stack-developer-job-in-uk-zj6hqqplk0un",
        "category": [
            "Full Stack Developer"
        ],
        "location": "United Kingdom UK",
        "country": "GB"
    },
    {
        "created": "2023-07-21T06:43:58+00:00",
        "expires": "2023-08-17T06:22",
        "sourced": "public domain",
        "unique": 1252390,
        "companyName": "Avanti Recruitment",
        "companyUrl": "https://zobjobs.com/company/false",
        "title": "C# Developer",
        "description": "Avanti Recruitment are working with a company near Wallingford looking for a full-stack developer.<br><br>The company provide the software and services that go into making moving house a positive experience. They cover everything from conveyancing, mortgages, EPCs, floorplans, surveys, auctions, removals and insurances.<br><br>Salary is roughly 55k, and you would need to go into the office twice a week.<br><br>You will be working in a bright team of C# and frontend developers working across .Net and front end.<br><br>Skills (not all required!)<br>• C# ASP.NET<br>• SQL Server<br>• MVC<br>• HTML5, CSS3, LESS<br>• jQuery<br>• WebAPI<br>• Experience with IoC & DI<br>• Dapper<br>• ORM<br>• PowerBI/MSSRS<br>• MS Azure<br><br>Apply for this C# developer role now for immediate consideration.",
        "link": "https://zobjobs.com/job/c-developer-full-stack-developer-job-in-uk-zj6hqqplk1gc",
        "category": [
            "Full Stack Developer",
            "ASP Developer"
        ],
        "location": "United Kingdom UK",
        "country": "GB"
    },
    {
        "created": "2023-07-21T06:43:58+00:00",
        "expires": "2023-08-17T06:22",
        "sourced": "public domain",
        "unique": 1252388,
        "companyName": "Spectrum IT Recruitment",
        "companyUrl": "https://zobjobs.com/company/false",
        "title": "Full stack Developer - Tech for Good",
        "description": "Full stack Developer<br><br>Salary 45,000 - 60,000 based on experience + Hybrid working<br><br>We are seeking an enthusiastic Full stack Developer / UI Developer to join a growing company delivering innovative, tech for good, software products. The business is investing in modernising several key products and can offer scope for progression as they continue to grow.<br><br>The Full stack Developer will work on both front and back end technologies, with the ideal candidates having previous commercial experience with C# and Blazor, however candidates with strong .Net backgrounds and experience of front-end development with HTML, CSS and modern JavaScript frameworks will also be considered. The Full stack Developer will translate designs from the UX designer into code, so previous experience of working with UX designers is essential.<br><br>The role supports hybrid working with 1 day a week in the offices, which are commutable from Farnborough, Woking, Guildford areas.<br><br>Core requirements:<br>• A commercial background in full stack development with .Net, C# as the prominent back end technology<br>• 2 years+ experience with HTML, CSS, JavaScript or Blazor<br>• An appreciation for UX, will have worked with UX designers previously<br>• Experience of working the full development life cycle<br>• Commercial experience with SOLID, TDD or similar principles<br><br>Desirable<br>• Experience developing and delivering customer facing applications<br>• Commercial experience with Blazor<br><br>All candidates applying must be eligible to work in the UK and be UK based.<br><br>Spectrum IT Recruitment (South) Limited is acting as an Employment Agency in relation to this vacancy",
        "link": "https://zobjobs.com/job/full-stack-developer-tech-for-good-job-in-uk-zj6hqqplk0k3",
        "category": [
            "Full Stack Developer"
        ],
        "location": "United Kingdom UK",
        "country": "GB"
    },
    {
        "created": "2023-07-21T06:43:58+00:00",
        "expires": "2023-08-17T06:22",
        "sourced": "public domain",
        "unique": 1252386,
        "companyName": "Cabinet Office",
        "companyUrl": "https://zobjobs.com/company/false",
        "title": "Full Stack Software Engineer",
        "description": "Details<br><br>Reference number<br><br>301578<br><br>Salary<br><br>£50,694 - £61,848<br><br>National £50,694 - £57,654 London £55,794 - £61,848 Offers above the band minimum are subject to our assessment of your skills and experience as demonstrated at interview. Salaries over the band minimum will be paid as a non-pensionable allowance.<br><br>A Civil Service Pension with an average employer contribution of 27%<br><br>Job grade<br><br>Grade 7<br><br>Contract type<br><br>Permanent<br><br>Business area<br><br>CO - Strategy Delivery and Private Office - The Government Strategic Management Office builds the tools and approach for tracking governments work, including a cross-government web platform. We are part of the recently formed Delivery Group, which spans Cabinet Office and No.10.<br><br>Type of role<br><br>Digital<br><br>Working pattern<br><br>Flexible working, Full-time, Part-time<br><br>Number of jobs available<br><br>2<br><br>Contents<br><br>Location<br><br>About the job<br><br>Benefits<br><br>Things you need to know<br><br>Apply and further information<br><br>Location<br><br>Glasgow, London<br><br>About the job<br><br>Job summary<br><br>We are developing a new end-to-end project delivery reporting system to support the implementation of government priorities, and present evidence and analysis in visually engaging ways for senior decision makers.<br><br>We are looking for a developer to join our small software engineering team, building this critical part of Government’s future tooling. You will have the opportunity to have genuine impact on how Government manages its work and to contribute to its overall effectiveness.<br><br>Job description<br><br>We are at an exciting stage, as we move from a modestly sized application, to being a business critical part of how government manages its most important areas of work. This will mean working on how the application scales, building new features, and potentially working on setting up new, adjacent applications for critical parts of government’s activities.<br><br>Main Responsibilities:<br><br>You will work on both the front and back end of the application, mainly in Javascript, working with a range of AWS services. Our core stack includes React, Node.js, and Postgres, so you will need to be comfortable working with these. There will however be scope for helping to decide on which other technologies we bring into our application. Each engineer is involved across the full range of responsibilities. Your work will therefore include managing our infrastructure and responding to any performance issues, building server functionality and new microservices, database management and schema changes, prototyping and building new front end features, and testing and deployment. There will also be opportunities to engage directly with users in a range of roles across government, and to help shape the overall direction of the product.<br><br>Person specification<br><br>You can expect to have responsibility to:<br>• Build accessible and interactive interfaces, server functionality, and microservices, taking responsibility for the quality of your code.<br>• Decide and evolve how we structure and manage our data.<br>• Be a confident communicator, able to bridge the gap between the technical and non-technical team members to build the right product.<br><br>You will be able to competently demonstrate:<br>• Experience of front-end development, with detailed knowledge of HTML, CSS and JavaScript.<br>• Experience of technologies used for web applications, e.g HTTPS, JSON and CDNs, and of Unix-like operating systems, eg Linux or macOS.<br>• Experience of back-end data infrastructure, including SQL databases.<br>• Understanding of software design principles, including progressive enhancement.<br>• Experience in building robust and accessible interfaces that work for multiple users.<br>• An understanding of front-end web performance.<br>• Ability to quickly research and learn new programming tools and techniques.<br>• Experience of writing robust code using approaches such as TDD/BDD, unit testing, integration testing and feature testing.<br>• Understanding of agile principles and working practices.<br>• Experience of code reviewing workflows and version control.<br>• Experience of user-centred design principles and delivering to user needs.<br><br>Behaviours<br><br>Well assess you against these behaviours during the selection process:<br>• Managing a Quality Service<br>• Seeing the Big Picture<br>• Delivering at Pace<br><br>Technical skills<br><br>Well assess you against these technical skills during the selection process:<br>• Software engineering<br><br>Benefits<br><br>Alongside your salary of £50,694, Cabinet Office contributes £13,687 towards you being a member of the Civil Service Defined Benefit Pension scheme. Find out what benefits a Civil Service Pension provides.<br>• Learning and development tailored to your role.<br>• An environment with flexible working options.<br>• A culture encouraging inclusion and diversity.<br>• A Civil Service pension.<br>• A minimum of 25 days of paid annual leave, increasing by one day per year up to a maximum of 30.<br><br>Things you need to know<br><br>Selection process details<br><br>This vacancy is using Success Profiles (opens in a new window), and will assess your Behaviours, Strengths, Experience and Technical skills.<br><br>Application Process<br><br>You must submit a statement of suitability of no more than 500 words and a CV, as well as statements in support of each of the behaviours listed.<br><br>Please ensure you refer to the main responsibilities, skills required, and behaviours listed when completing your statement of suitability.<br><br>Applications will be sifted on the basis of your statement of suitability as well as the statements your provide in support of each of the behaviours. If we receive a high volume of applications, we may sift applications solely on the basis of your statement of suitability. Candidates who pass the initial sift may be progressed to a full sift, or progressed straight to assessment/interview.<br><br>Selection Process<br><br>Assessment for these positions will include an interview and a short exercise to test your technical expertise. In interview part of the selection process will be based on the Civil Service Behaviours and Strengths in the Civil Service Success Profiles. More information will be made available to those invited to interview.<br><br>Expected Timeline (subject to change)<br><br>Expected sift date – week commencing 1/8/23<br>Expected interview date/s – week commencing 7/8/23<br>Interview location - by video, to be arranged with applicants<br><br>Reasonable Adjustments<br><br>If a person with disabilities is put at a substantial disadvantage compared to a non-disabled person, we have a duty to make reasonable changes to our processes.<br><br>If you need a change to be made so that you can make your application, you should:<br><br>Contact Government Recruitment Service via cabinetofficerecruitment.grs@cabinetoffice.gov.uk as soon as possible before the closing date to discuss your needs.<br><br>Complete the ‘Assistance required’ section in the ‘Additional requirements’ page of your application form to tell us what changes or help you might need further on in the recruitment process. For instance, you may need wheelchair access at interview, or if you’re deaf, a Language Service Professional.<br><br>Further Information<br><br>A reserve list may be held for a period of 12 months from which further appointments can be made.<br><br>Any move to Cabinet Office from another employer will mean you can no longer access childcare vouchers. This includes moves between government departments. You may however be eligible for other government schemes, including Tax Free Childcare. Determine your eligibility at https://www.childcarechoices.gov.uk<br><br>If successful and transferring from another Government Department a criminal record check may be carried out.<br><br>In order to process applications without delay, we will be sending a Criminal Record Check to Disclosure and Barring Service on your behalf.<br><br>However, we recognise in exceptional circumstances some candidates will want to send their completed forms direct. If you will be doing this, please advise Government Recruitment Service of your intention by emailing Pre-EmploymentChecks.grs@cabinetoffice.gov.uk stating the job reference number in the subject heading.<br><br>For further information on the Disclosure Scotland confidential checking service telephone: the Disclosure Scotland Helpline on 0870 609 6006 and ask to speak to the operations manager in confidence, or email Info@disclosurescotland.co.uk<br><br>Please note that this role requires SC clearance, which would normally need 5 years of UK residency prior to your application. This is not an absolute requirement, but supplementary checks may be needed where individuals have not lived in the UK for that period. This may mean your security clearance (and therefore your appointment) will take longer or, in some cases, not be possible.<br><br>Applicants who are successful at interview will be, as part of pre-employment screening, subject to a check on the Internal Fraud Database (IFD). This check will provide information about employees who have been dismissed for fraud or dishonesty offences. This check also applies to employees who resign or otherwise leave before being dismissed for fraud or dishonesty had their employment continued. Any applicant’s details held on the IFD will be refused employment.<br><br>A candidate is not eligible to apply for a role within the Civil Service if the application is made within a 5 year period following a dismissal for carrying out internal fraud against government.<br><br>New entrants are expected to join on the minimum of the pay band.<br><br>If you are experiencing accessibility problems with any attachments on this advert, please contact the email address in the contact point for applicants section.<br><br>Feedback will only be provided if you attend an interview or assessment.<br><br>Security<br><br>Successful candidates must undergo a criminal record check.<br><br>Successful candidates must meet the security requirements before they can be appointed. The level of security needed is security check (opens in a new window).<br><br>See our vetting charter (opens in a new window).<br><br>People working with government assets must complete baseline personnel security standard (opens in new window) checks.<br><br>Nationality requirements<br><br>This job is broadly open to the following groups:<br>• UK nationals<br>• nationals of Commonwealth countries who have the right to work in the UK<br>• nationals of the Republic of Ireland<br>• nationals from the EU, EEA or Switzerland with settled or pre-settled status or who apply for either status by the deadline of the European Union Settlement Scheme (EUSS) (opens in a new window)<br>• relevant EU, EEA, Swiss or Turkish nationals working in the Civil Service<br>• relevant EU, EEA, Swiss or Turkish nationals who have built up the right to work in the Civil Service<br>• certain family members of the relevant EU, EEA, Swiss or Turkish nationals<br><br>Further information on nationality requirements (opens in a new window)<br><br>Working for the Civil Service<br><br>The Civil Service Code (opens in a new window) sets out the standards of behaviour expected of civil servants.<br><br>We recruit by merit on the basis of fair and open competition, as outlined in the Civil Service Commissions recruitment principles (opens in a new window).<br><br>The Civil Service embraces diversity and promotes equal opportunities. As such, we run a Disability Confident Scheme (DCS) for candidates with disabilities who meet the minimum selection criteria.<br><br>Apply and further information<br><br>This vacancy is part of the Great Place to Work for Veterans (opens in a new window) initiative.<br><br>The Civil Service welcomes applications from people who have recently left prison or have an unspent conviction. Read more about prison leaver recruitment (opens in new window).<br><br>Once this job has closed, the job advert will no longer be available. You may want to save a copy for your records.<br><br>Contact point for applicants<br><br>Job contact :<br><br>Name :<br><br>Dominic Lague<br><br>Email :<br><br>dominic.lague@cabinetoffice.gov.uk<br><br>Recruitment team<br><br>Email :<br><br>cabinetofficerecruitment.grs@cabinetoffice.gov.uk<br><br>Further information<br><br>Appointment to the Civil Service is governed by the Civil Service Commission’s Recruitment Principles.<br><br>If you feel that your application has not been treated in accordance with the Recruitment Principles, and wish to make a complaint, then in the first instance you should contact Government Recruitment Service at: cabinetofficerecruitment.grs@cabinetoffice.gov.uk.<br><br>If you are not satisfied with the response that you receive, then you can contact the Civil Service Commission at: info@csc.gov.uk.<br><br>For further information on the Recruitment Principles, and bringing a complaint to the Civil Service Commission, please visit their website at: https://civilservicecommission.independent.gov.uk",
        "link": "https://zobjobs.com/job/full-stack-software-engineer-full-stack-developer-job-in-uk-zj6hqqpljvpe",
        "category": [
            "Full Stack Developer"
        ],
        "location": "United Kingdom UK",
        "country": "GB"
    },
    {
        "created": "2023-07-21T06:43:58+00:00",
        "expires": "2023-08-17T06:22",
        "sourced": "public domain",
        "unique": 1252387,
        "companyName": "N Consulting Ltd",
        "companyUrl": "https://zobjobs.com/company/false",
        "title": ".Net Full Stack Developer",
        "description": "• 8+ years of experience.<br>• Bachelor’s and/or Master’s degree or equivalent focusing on Computer Science, Computer Engineering or a related technical discipline.<br>• Strong experience with C# and .NET Core, Angular.<br>• Strong experience with SQL Server or Oracle.<br>• Strong experience with WinForms, WPF.<br>• Have finance and Banking domain experience.<br>• Agile, Test Driven Development and DevOps practices are part of your DNA.<br>• A Software Craftsperson focused on engineering best practices and delivering Clean Code.<br><br>Location: LONDON - Hybrid Role.",
        "link": "https://zobjobs.com/job/net-full-stack-developer-job-in-uk-zj6hqqplk046",
        "category": [
            "Full Stack Developer",
            ".NET"
        ],
        "location": "United Kingdom UK",
        "country": "GB"
    }
]